In [21]:
import pandas as pd
import numpy as np

In [22]:
books  = pd.read_csv('books.csv', sep=';', on_bad_lines='skip', encoding='latin-1')
users = pd.read_csv('users.csv', sep=';', on_bad_lines='skip', encoding='latin-1')
ratings = pd.read_csv('ratings.csv', sep=';', on_bad_lines='skip', encoding='latin-1')

C:\Users\srika\AppData\Local\Temp\ipykernel_24192\1983933513.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books  = pd.read_csv('books.csv', sep=';', on_bad_lines='skip', encoding='latin-1')

In [23]:
books.rename(columns={'Book-Title':'title',
                      'Book-Author':'author',
                      'Year-Of-Publication':'year',
                      'Publisher':'publisher',
                      'Image-URL-S':'img_url_s',
                      'Image-URL-M':'img_url_m',
                      'Image-URL-L':'img_url'}, inplace=True)

In [24]:
books.drop(columns=['img_url_s', 'img_url_m'], inplace=True)

In [25]:
books.head()

,ISBN,title,author,year,publisher,img_url
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...

In [26]:
users.rename(columns={'User-ID': 'user_id'}, inplace=True)

In [27]:
users.head()

   user_id                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [29]:
ratings.rename(columns={'User-ID': 'user_id', 'Book-Rating': 'rating'}, inplace=True)

In [30]:
ratings.head()

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5
2   276727  0446520802       0
3   276729  052165615X       3
4   276729  0521795028       6